{
    "header":{
        "titulo":"Program Interpreter",
        "subtitulo":"Run your program written on Sintaxiscript."
    },
    "verificador":{
        "label":"Enter your program on a .TXT file"
    },
    "documentacion_header":{
        "titulo":"Language Documentation",
        "descripcion":"Sintaxiscript is a language where a program is a sequence of statements. Each statement can be a variable declaration, an assignment, a write, a read, a conditional (if/if else), or a while loop.",
        "caracteristicas_titulo":"Other important features are:",
        "caracteristica_1":"All variables in a program are of the type real constant and need not be indicated.",
        "caracteristica_2":"An arithmetic expression can include the arithmetic operators: + to indicate addition, - to indicate subtraction, * to indicate a product, / to indicate division, ^ to indicate power, and RAIZ (spanish word = ROOT) to indicate a root."
    },
    "documentacion1":{
        "titulo":"Writing a program in Sintaxiscript",
        "descripcion":"» To start the declaration of a program, the keyword Program is used together with a program identifier. The body of the program is enclosed in curly braces { BODY }.",
        "c1":"// Program body"
    },
    "documentacion2":{
        "titulo":"Statement declaration",
        "descripcion":"» To declare statements in Sintaxiscript you must take into account the use of ; as a statement separator, i.e., whenever this statement does not represent the last one before a closing curly brace }",
        "c1":"// . is used to denote decimals in a real constant.",
        "c2":"add" 
    },
    "documentacion3":{
        "titulo":"Variable declaration",
        "descripcion":"» Every variable must be declared BEFORE it is used. These declarations will be made using the var keyword and then the list of variables to be declared separated by commas."
    },
     "documentacion4":{
        "titulo":"Variable assignment",
        "descripcion":"» Any assignment will be made to an arithmetic expression on real numbers. Under this concept, assignments to other variables (since they contain real numbers) or any valid arithmetic operation mentioned above will be admitted. Note the use of parentheses ( ) to indicate priorities in arithmetic operations.",
        "c1":"add",
        "c2":"sub",
        "c3":"mult",
        "c4":"quo",
        "c5":"exp",
        "c6":"square",
        "c7":"compOperation",
        "c8":"// The radicand must be enclosed in parentheses: RAIZ (radicand)",
        "c9":"// Use of parentheses to indicate priorities in arithmetic operations."
    },
    "documentacion5":{
        "titulo":"Conditional statements",
        "descripcion":"» To declare a conditional statement, the keywords if and else are used. The condition will be represented in square brackets [CONDITION]. It is also possible to use logical operators (and, or, not).",
        "c1":"change"
    },
    "documentacion6":{
        "titulo":"While loop declaration",
        "descripcion":"» The while loop will function similarly, syntactically, to the conditional structure. The condition will also be enclosed in square brackets [CONDITION]. Then it is also possible to use logical operators (and, or, or, not).",
        "c1":"change"
    },
    "documentacion7":{
        "titulo":"On-screen printing",
        "descripcion":"» The Print keyword is used to print on the screen, which takes as arguments, separated by commas, strings (which are written enclosing them with double quotes: \"example string\"), arithmetic expressions, identifiers or real constants.",
        "c1":"money",
        "c2":"// Use of parentheses to indicate priorities in arithmetic operations.",
        "c3":"\"The current balance is: \"",
        "c4":"\"The double of current balance is: \"",
        "c5":"\" this is a string to show that it's the end of the program\""
    },
     "documentacion8":{
        "titulo":"Reading a variable",
        "descripcion":"» Read keyword is used to read a variable and receives two arguments (\"string\", id), where \"string\" is a string to be displayed on the screen and id is the variable to be read.",
        "c1":"balance",
        "c2":"ticket",
        "c3":"\"Current balance: \"",
        "c4":"\"For 50 still missing: \"",
        "c5":"\"Type of ticket: \"",
        "c6":"\" has been purchased\""
    },
   "documentacion9":{
        "titulo":"Example of a complete program syntax",
        "descripcion":"» This is a program that calculates the highest value from a list of numbers entered by the user.",
        "c1":"maximum",
        "c2":"value",
        "c3":"\"Enter a value: \"",
        "c4":"\"Do you want to continue?, type 0 to exit\"",
        "c5":"\"The maximum value is: \""
    },
    "menu":{
        "1": "Execute Lexical Analyzer",
        "2": "Execute Syntactic Analyzer",
        "3": "Execute Interpreter"
    }
}