{
    "header":{
        "titulo":"Interprete de programas",
        "subtitulo":"Ejecute su programa escrito en Sintaxiscript."
    },
    "verificador":{
        "label":"Ingrese su programa en un archivo .TXT"
    },
    "documentacion_header":{
        "titulo":"Documentacion del lenguaje",
        "descripcion":"Sintaxiscript es un lenguaje donde un programa es una secuencia de sentencias. Cada sentencia puede ser una declaracion de variables, una asignacion, una escritura, una lectura, un condicional (if / if else) o un ciclo while.",
        "caracteristicas_titulo":"Otras caracteristicas importantes son:",
        "caracteristica_1":"Todas las variables en un programa son del tipo constante real y no es necesario indicarlo.",
        "caracteristica_2":"Una expresion aritmetica puede incluir los operadores aritmeticos: + para indicar suma, - para indicar resta, * para indicar producto, / para indicar division, ^ para indicar potenciacion, RAIZ para indicar una raiz."
    },
    "documentacion1":{
        "titulo":"Escribiendo un programa en Sintaxiscript",
        "descripcion":"» Para iniciar la declaracion de un programa se utiliza la palabra reservada Program junto a un identificador del programa. El cuerpo del programa se encerrara mediante llaves {CUERPO}.",
        "c1":"// Cuerpo del programa"
    },
    "documentacion2":{
        "titulo":"Declaracion de una sentencias",
        "descripcion":"» Para declarar sentencias en Sintaxiscript se debe tener en cuenta la utilizacion del punto y coma ; como separador de sentencias, es decir, siempre que esta sentencia no represente la ultima antes de un cierre mediante llave }",
        "c1":"// Se utiliza . para denotar decimales en una constante real",
        "c2":"suma"
    },
     "documentacion3":{
        "titulo":"Declaracion de variables",
        "descripcion":"» Toda variable debe ser declarada ANTES de ser utilizada. Dichas declaraciones se haran mediante la palabra reservada var y luego la lista de variables que se quieran declarar separadas mediante coma."
    },
    "documentacion4":{
        "titulo":"Asignacion de variables",
        "descripcion":"» Toda asignacion se hara hacia una expresion aritmetica sobre numeros reales. Bajo este concepto seran admitidas asignaciones a otras variables (ya que contienen numeros reales) o cualquier operacion aritmetica valida antes mencionada. Debe tenerse en cuenta la utilizacion de parentesis ( ) para indicar prioridades en las operaciones aritmeticas.",
        "c1":"suma",
        "c2":"resta",
        "c3":"producto",
        "c4":"cociente",
        "c5":"potencia",
        "c6":"radical",
        "c7":"opCombinada",
        "c8":"// El radicando debe ir entre parentesis: RAIZ (radicando)",
        "c9":"// Parentesis para indicar prioridad en operaciones algebraicas"
    },
    "documentacion5":{
        "titulo":"Sentencias condicionales",
        "descripcion":"» Para declarar una sentencia condicional se utilizan las palabras reservadas if y else. La condicion se representara entre corchetes [CONDICION]. Es posible utilizar operadores logicos (and, or, not)",
        "c1":"cambio"
    },
    "documentacion6":{
        "titulo":"Declaracion de un ciclo while",
        "descripcion":"» El ciclo while funcionara de manera similar, sintacticamente, a la estructura condicional. La condicion quedara tambien encerrada entre corchetes [CONDICION]. Es posible utilizar operadores logicos (and, or, not)",
        "c1":"cambio"
    },
     "documentacion7":{
        "titulo":"Escritura en pantalla",
        "descripcion":"» Para realizar impresiones en pantalla se utiliza la palabra reservada Print que recibe como argumentos,separados por comas, a cadenas, que se escriben encerrandolas con \"ejemplo cadena\", y expresiones aritmeticas, identificadores o constantes reales.",
        "c1":"dinero",
        "c2":"// Parentesis para indicar prioridad en operaciones algebraicas",
        "c3":"\"El dinero actual es: \"",
        "c4":"\"El doble del dinero actual es: \"",
        "c5":"\"fin de programa\""
    },
    "documentacion8":{
        "titulo":"Lectura de una variable",
        "descripcion":"» Para leer una variable se utiliza la palabra reservada Read que recibe como argumentos (\"cadena\",id). Donde cadena es una cadena que se muestra en pantalla e id es la variable a leer.",
        "c1":"dinero",
        "c2":"boleto",
        "c3":"\"dinero disponible\"",
        "c4":"\"Para 50 aun faltan: \"",
        "c5":"\"tipo de boleto\"",
        "c6":"\"ha sido adquirido\""
    },
     "documentacion9":{
        "titulo":"Ejemplo de un programa completo",
        "descripcion":"» Se trata de un programa que calcula el maximo valor entre una lista de valores ingresados por el usuario.",
        "c1":"maximo",
        "c2":"valor",
        "c3":"\"Ingrese un valor: \"",
        "c4":"\"Desea continuar?, ingrese 0 para salir\"",
        "c5":"\"El valor maximo es: \""
    },
    "menu":{
        "1": "Ejecutar Analizador Lexico",
        "2": "Ejecutar Analizador Sintactico",
        "3": "Ejecutar Interprete"
    }
}